In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [2]:
h = ['AA', '2012-02-01', 100, 10.2]
s =pd.Series(h)

In [3]:
s

0            AA
1    2012-02-01
2           100
3          10.2
dtype: object

In [4]:
type(s)

pandas.core.series.Series

In [6]:
y = ('AA', '2012-02-01', 100, 10.2)
z =pd.Series(y)

In [7]:
z

0            AA
1    2012-02-01
2           100
3          10.2
dtype: object

In [8]:
 d = {'name' : 'IBM', 'date' : '2010-09-08', 'shares' : 100, 'price' : 10.2}

In [10]:
sd = pd.Series(d)

In [13]:
print(sd)

name             IBM
date      2010-09-08
shares           100
price           10.2
dtype: object

In [14]:
type(sd)

pandas.core.series.Series

In [15]:
f = ['SHOLA', 23, 'MALE','STUDENT']
df =pd.Series(f, index =['NAME', 'AGE','GENDER', 'OCCUPATION'])

In [16]:
df

NAME            SHOLA
AGE                23
GENDER           MALE
OCCUPATION    STUDENT
dtype: object

In [17]:
df['AGE']

23

In [18]:
# dataframe
data = { 'name' : ['AA', 'IBM', 'GOOG'],
        'date' : ['2001-12-01', '2012-02-10', '2010-04-09'], 
        'shares' : [100, 30, 90],        
        'price' : [12.3, 10.3, 32.2] }

In [19]:
df1 = pd.DataFrame(data)

In [20]:
df1

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [28]:
df1['unknown'] = 12

In [29]:
df1

   name        date  shares  price  unknown
0    AA  2001-12-01     100   12.3       12
1   IBM  2012-02-10      30   10.3       12
2  GOOG  2010-04-09      90   32.2       12

In [30]:
del df1['unknown']

In [31]:
df1

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [32]:
df1.index = ['a','b','c']

In [33]:
df1

   name        date  shares  price
a    AA  2001-12-01     100   12.3
b   IBM  2012-02-10      30   10.3
c  GOOG  2010-04-09      90   32.2

In [34]:
df1.set_index(['name'])

            date  shares  price
name
AA    2001-12-01     100   12.3
IBM   2012-02-10      30   10.3
GOOG  2010-04-09      90   32.2

In [35]:
df1

   name        date  shares  price
a    AA  2001-12-01     100   12.3
b   IBM  2012-02-10      30   10.3
c  GOOG  2010-04-09      90   32.2

In [36]:
df1['shares']

a    100
b     30
c     90
Name: shares, dtype: int64

In [44]:
df2 =df1.ix['IBM']

AttributeError: 'DataFrame' object has no attribute 'ix'